app/controllers/categories_controller.rb

  def index
    @categories = Category.all.order(:title)
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."title" ASC